/* а) Используйте прототипное наследование.
б) Базовый класс должен состоять из минимум 6 различных свойств.
в) Каждый класс - наследник должен расширять базовый класс и включать два или более дополнительных свойства.
г) Каждый класс - наследник должен унаследовать как минимум 1 метод из родительского класса. Также добавьте по одному уникальному методу каждому классу наследнику.


Класс «Растение». Наследуемые классы: папоротник и ель обыкновенная. Возможные поля: название, описание, вид, возраст, класс, размер соцветия, класс опасности, ареал произрастания, область применения (в пищевой промышленности, в получении лекарственных препаратов, в сельском хозяйстве...), первооткрыватель, место произрастания и т.д. */




 